NextFOAM-2501/tutorials/lagrangian/kinematicParcelFoam/pitzDailyWithSprinklers/system/faMeshDefinition
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      faMeshDefinition;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

polyMeshPatches ( base );

boundary
{
    inlet
    {
        type patch;
        //ownerPolyPatch      base;
        neighbourPolyPatch  inlet;
    }

    outlet
    {
        type patch;
        //ownerPolyPatch      base;
        neighbourPolyPatch  outlet;
    }

    sides
    {
        type patch;
        //ownerPolyPatch      base;
        neighbourPolyPatch  sides;
    }
}


// ************************************************************************** //
